const title = 'Birzeit University Information Security Advisory Plan';
const link_title = ' ';
const url = ' ';
const link_more_info = ' ';
const courses = [
    //['NAME', 'CODE', ['requirement']s, 'notes']
    //'year 1 semester 1',
    ['مهارات اللغة العربية 1', 'ARAB135', []],
    ['لغة إنجليزية مستوى متوسط 3', 'ENGC2201', []],
    ['مقدمة في الحاسوب وأخلاقيات الحوسبة', 'COMP1310',[]],
    ['التفاضل والتكامل 1', 'MATH1411', []],
    ['مقدمه في الأمن السيبراني وأخالقيات المهنة', 'CSEC1310', []],

    'year 1 semester2',
    ['مهارات اللغة العربية 2', 'ARAB136', ['ARAB135']],
    ['لغة إنجليزية مستوى متوسط 4', 'ENGC2202', ['ENGC2201']],
    ['الحاسوب والبرمجة', 'COMP1331', ['COMP1310']],
    ['التفاضل والتكامل 2', 'MATH1321', ['MATH1411']],
    ['الرياضيات المنفصلة', 'COMP233', ['MATH1411']],
    ['التثبت من الهوية والتحكم في الوصول', 'CSEC1320', ['CSEC1310']],

    'year 2 semester 1',
    ['البرمجة الشيئية', 'COMP2311', ['COMP1331']],
    ['لغة إنجليزية مستوى متقدم 1', 'ENGC2203', ['ENGC2202']],
    ['شبكات الحاسوب', 'ENCS3320', ['COMP1331']],
    ['مختبر نظام تشغيل لينوكس', 'COMP311', ['COMP1331']],
    ['أنظمة رقمية', 'ENCS2340', ['COMP1331']],
    ['الرياضيات لأمن المعلومات', 'CSEC2320', ['COMP233']],

    'year 2 semester 2',
    ['بنية المعلومات', 'COMP242', ['COMP2311']],
    ['لغة إنجليزية مستوى متقدم 2', 'ENGC2204', ['ENGC2203']],
    ['مختبر شبكات الحاسوب', 'ENCS4130', ['ENCS3320']],
    ['التشفير', 'CSEC2350', ['CSEC2320']],
    ['الاحتمالات والإحصاء', 'ENEE2307', ['MATH1321']],
    ['الكتف حر', ' ', ['-']],

    'year 3 semester 1',
    ['إدارة قواعد البيانات', 'COMP3330', ['COMP242']],
    ['تحليل الخوارزميات', 'COMP336', ['COMP242']],
    ['نظم التشغيل', 'COMP431', ['COMP311','COMP242']],
    ['أمن الشبكة', 'CSEC3310', ['CSEC1310','CSEC2350']],
    ['إدارة المخاطر الأمنية', 'CSEC3340', ['CSEC1320']],

    'year 3 semester 2',
    ['تطبيقات وتقنيات الويب', 'COMP3340', ['COMP3330']],
    ['الهندسة البرمجية', 'COMP433', ['COMP3330']],
    ['أمن نظم التشغيل', 'CSEC3350', ['COMP431']],
    ['اختياري تخصص', 'CSEC33xx', ['-'], `<table><tr><th>الرمز</th><th>المادة</th></tr>
                                                    <tr><td>CSEC3360</td><td>أمن قواعد البيانات</td></tr>
                                                    </table>`],
    ['الكتف حر', ' ', ['-']],


    ['التدريب العملي', 'CSEC3300', ['-'], 'موافقة الدائرة وإتمام 90 ساعة<br>يؤخذ صيفا', 2],


    'year 4 semester 1',
    ['مقدمة مشروع التخرج', 'CSEC4200', ['CSEC4310'],'أو تزامن'],
    ['هندسة البرمجيات الآمنة', 'CSEC4310', ['COMP433']],
    ['الحضارة الاوروبية الحديثه والمعاصره', 'CULS331', ['-'],'يجب انهاء 30 ساعة'],
    ['اختياري تخصص', 'CSEC43xx', ['-'], `<table><tr><th>الرمز</th><th>المادة</th></tr>
                                                    <tr><td>CSEC4330</td><td>أمن الويب</td></tr>
                                                    <tr><td>CSEC4340</td><td>أنظمة كشف التسلل والاختراق</td></tr>
                                                    <tr><td>CSEC4360</td><td>أمن الهاتف المحمول</td></tr>
                                                    <tr><td>CSEC4370</td><td>الجرائم الالكترونية والقوانين</td></tr>
                                                    <tr><td>CSEC4380</td><td>الخصوصية وإخفاء الهوية</td></tr>
                                                    <tr><td>CSEC4390</td><td>الأنظمة الموزعة الآمنة</td></tr>
                                                    <tr><td>CSEC4391</td><td>أمن الأجهزة</td></tr>
                                                    <tr><td>CSEC4399</td><td>موضوعات خاصة</td></tr>
                                                    </table>`],
    ['اختياري تخصص', 'CSEC43xx', ['-'], `<table><tr><th>الرمز</th><th>المادة</th></tr>
                                                    <tr><td>CSEC4330</td><td>أمن الويب</td></tr>
                                                    <tr><td>CSEC4340</td><td>أنظمة كشف التسلل والاختراق</td></tr>
                                                    <tr><td>CSEC4360</td><td>أمن الهاتف المحمول</td></tr>
                                                    <tr><td>CSEC4370</td><td>الجرائم الالكترونية والقوانين</td></tr>
                                                    <tr><td>CSEC4380</td><td>الخصوصية وإخفاء الهوية</td></tr>
                                                    <tr><td>CSEC4390</td><td>الأنظمة الموزعة الآمنة</td></tr>
                                                    <tr><td>CSEC4391</td><td>أمن الأجهزة</td></tr>
                                                    <tr><td>CSEC4399</td><td>موضوعات خاصة</td></tr>
                                                    </table>`],

    'year 4 semester 2',
    ['مشروع التخرج', 'CSEC4300', ['CSEC4200']],
    ['القرصنة الأخلاقية', 'CSEC4320', ['CSEC2350','ENCS3320']],
    ['اختياري تخصص', 'CSEC43xx', ['-'], `<table><tr><th>الرمز</th><th>المادة</th></tr>
                                                    <tr><td>CSEC4330</td><td>أمن الويب</td></tr>
                                                    <tr><td>CSEC4340</td><td>أنظمة كشف التسلل والاختراق</td></tr>
                                                    <tr><td>CSEC4360</td><td>أمن الهاتف المحمول</td></tr>
                                                    <tr><td>CSEC4370</td><td>الجرائم الالكترونية والقوانين</td></tr>
                                                    <tr><td>CSEC4380</td><td>الخصوصية وإخفاء الهوية</td></tr>
                                                    <tr><td>CSEC4390</td><td>الأنظمة الموزعة الآمنة</td></tr>
                                                    <tr><td>CSEC4391</td><td>أمن الأجهزة</td></tr>
                                                    <tr><td>CSEC4399</td><td>موضوعات خاصة</td></tr>
                                                    </table>`],

    ['اختياري تخصص', 'CSEC43xx', ['-'], `<table><tr><th>الرمز</th><th>المادة</th></tr>
                                                    <tr><td>CSEC4330</td><td>أمن الويب</td></tr>
                                                    <tr><td>CSEC4340</td><td>أنظمة كشف التسلل والاختراق</td></tr>
                                                    <tr><td>CSEC4360</td><td>أمن الهاتف المحمول</td></tr>
                                                    <tr><td>CSEC4370</td><td>الجرائم الالكترونية والقوانين</td></tr>
                                                    <tr><td>CSEC4380</td><td>الخصوصية وإخفاء الهوية</td></tr>
                                                    <tr><td>CSEC4390</td><td>الأنظمة الموزعة الآمنة</td></tr>
                                                    <tr><td>CSEC4391</td><td>أمن الأجهزة</td></tr>
                                                    <tr><td>CSEC4399</td><td>موضوعات خاصة</td></tr>
                                                    </table>`],
    ['الفكر العربي الحديث والمعاصر', 'CULS332', ['-'],'يجب انهاء 30 ساعة']
];
